aivoprykk/espidf-gps-logger/sdkconfig.defaults.esp32s3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_PROJECT_VER=103
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BOOTLOADER_WDT_ENABLE=n
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="two_ota_large_s3.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xc000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_SPI_SLAVE_ISR_IN_IRAM=n
CONFIG_UART_ISR_IN_IRAM=y
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM=y
CONFIG_GPTIMER_ISR_IRAM_SAFE=y
CONFIG_I2S_ISR_IRAM_SAFE=y
CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM=y
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_ESP_SLEEP_MSPI_NEED_ALL_IO_PU=n
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=n
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_ESP_PHY_REDUCE_TX_POWER=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=1024
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_ESP_IPC_TASK_STACK_SIZE=2048
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=6
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=16
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_FATFS_VOLUME_COUNT=3
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_FS_LOCK=10
CONFIG_FATFS_USE_FASTSEEK=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1024
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_FREERTOS_ISR_STACKSIZE=4096
CONFIG_HEAP_POISONING_COMPREHENSIVE=y
CONFIG_HEAP_TRACING_STANDALONE=y
CONFIG_HEAP_TRACING_STACK_DEPTH=3
CONFIG_HEAP_USE_HOOKS=y
CONFIG_HEAP_TASK_TRACKING=y
CONFIG_HEAP_TRACE_HASH_MAP=y
CONFIG_HEAP_TRACE_HASH_MAP_SIZE=10
CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS=y
CONFIG_LWIP_LOCAL_HOSTNAME="esp-logger"
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_LWIP_DHCPS_MAX_STATION_NUM=4
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=6144
CONFIG_LWIP_TCP_WND_DEFAULT=6144
CONFIG_LWIP_TCP_RECVMBOX_SIZE=8
CONFIG_LWIP_UDP_RECVMBOX_SIZE=8
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096
CONFIG_MQTT_PROTOCOL_311=n
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_MQTT_TRANSPORT_WEBSOCKET=n
CONFIG_SPI_FLASH_CHECK_ERASE_TIMEOUT_DISABLED=y
CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP=n
CONFIG_SPI_FLASH_SUPPORT_MXIC_CHIP=n
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=n
CONFIG_SPI_FLASH_SUPPORT_WINBOND_CHIP=n
CONFIG_SPI_FLASH_SUPPORT_TH_CHIP=n
CONFIG_SPI_FLASH_ENABLE_ENCRYPTED_READ_WRITE=n
CONFIG_SPIFFS_MAX_PARTITIONS=2
CONFIG_SPIFFS_OBJ_NAME_LEN=48
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=4
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=10
CONFIG_WIFI_PROV_STA_FAST_SCAN=y
CONFIG_DISPLAY_LOG_LEVEL_INFO=y
CONFIG_LITTLEFS_MAX_PARTITIONS=2
CONFIG_GPS_LOG_ENABLE=n
CONFIG_GPS_LOG_STACK_SIZE=3072
CONFIG_GPS_LOG_ENABLE_GPY=n
CONFIG_GPS_LOG_LEVEL_INFO=y
CONFIG_BTN_GPIO_INPUT_LONG_PRESS_TIME_MS=1500
CONFIG_BTN_GPIO_INPUT_LONG_LONG_PRESS_TIME_MS=3000
CONFIG_LOGGER_COMMON_LOG_LEVEL_INFO=y
CONFIG_BMX_ENABLE=n
CONFIG_LOGGER_HTTP_LOG_LEVEL_INFO=y
CONFIG_WEB_SERVER_APPEND_MAC_TO_HOSTNAME=y
CONFIG_WEB_SERVER_TASK_STACK_SIZE=4608
CONFIG_WEB_SERVER_ASYNC_WORKER_TASK_STACK_SIZE=3584
CONFIG_UBLOX_LOG_LEVEL_INFO=y
CONFIG_USE_LITTLEFS=y
CONFIG_LITTLEFS_PARTITION_LABEL="store"
CONFIG_LOGGER_WIFI_LOG_LEVEL_INFO=y
CONFIG_WIFI_TASK_STACK_SIZE=3072
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_SIZE_KILOBYTES=16
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_ASSERT_STYLE=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_UNSCII_8=y
CONFIG_LV_USE_FONT_SUBPX=y
CONFIG_LV_USE_ARC=n
CONFIG_LV_USE_BTN=n
CONFIG_LV_USE_BTNMATRIX=n
CONFIG_LV_USE_CHECKBOX=n
CONFIG_LV_USE_DROPDOWN=n
CONFIG_LV_LABEL_TEXT_SELECTION=n
CONFIG_LV_LABEL_LONG_TXT_HINT=n
CONFIG_LV_USE_ROLLER=n
CONFIG_LV_USE_SWITCH=n
CONFIG_LV_USE_TEXTAREA=n
CONFIG_LV_USE_TABLE=n
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_COLORWHEEL=n
CONFIG_LV_USE_IMGBTN=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_METER=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_SPINNER=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n
CONFIG_LV_USE_THEME_BASIC=n
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_BUTTON_LONG_PRESS_TIME_MS=2000
CONFIG_MDNS_TASK_STACK_SIZE=2560
